CSI API ETABS v1
cCaseResponseSpectrum Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cCaseResponseSpectrum
Public Interface cCaseResponseSpectrum
Dim instance As cCaseResponseSpectrum
public interface class cCaseResponseSpectrum
type cCaseResponseSpectrum =  interface end
The cCaseResponseSpectrum type exposes the following members.
Methods
Name | Description
GetDampConstant
GetDampInterpolated
GetDampOverrides
GetDampProportional
GetDampType
GetDiaphragmEccentricityOverride
GetDirComb
GetEccentricity
GetLoads
GetModalCase
GetModalComb
GetModalComb_1
SetCase
SetEccentricity
SetLoads
SetModalCase
Top
See Also
Reference
ETABSv1 Namespace